[

  {
    "_id": {"$oid": "47ca51b0e787c0f3a8bd4d6e"},
    "name": "Soupe aux restes de légumes",
    "description": "Une soupe simple et savoureuse utilisant les restes de légumes pour éviter le gaspillage alimentaire. Cette soupe est idéale pour réchauffer les jours froids ou comme repas léger à tout moment de l'année.",
    "type_of_cuisine": 0,
    "type_of_dishes": 1,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 1,
    "nutritional_value": [true, true, true, true, false, false, false, false],
    "preparation_steps": [
      "Couper les restes de légumes en morceaux de taille uniforme pour une cuisson uniforme.",
      "Faire revenir les légumes dans une casserole avec un peu d'huile d'olive jusqu'à ce qu'ils soient tendres.",
      "Ajouter de l'eau ou du bouillon de légumes pour couvrir les légumes.",
      "Laisser mijoter pendant 20-30 minutes pour que les saveurs se mélangent et que les légumes soient bien cuits."
    ],
    "photo": "https://www.framboizeinthekitchen.com/wp-content/uploads/2014/11/soupe1-restes-ameliores-framboizeinthekitchen-687x640.jpg",
    "ingredients": ["restes de légumes", "bouillon de légumes"],
    "quantity_ingredients": ["400g", "500ml"],
    "tags": ["soupe", "Recette anti-gaspillage", "végétarien"]
  },
  {
    "_id": {"$oid": "24b8f29c9a0d164e9b3a6ec7"},
    "name": "Croquettes aux restes de riz",
    "description": "Une façon créative d'utiliser les restes de riz pour préparer des croquettes croustillantes et savoureuses. Ces croquettes peuvent être servies en accompagnement ou en tant que plat principal avec une salade fraîche.",
    "type_of_cuisine": 0,
    "type_of_dishes": 2,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 2,
    "nutritional_value": [false, false, true, false, false, false, false, false],
    "preparation_steps": [
      "Mélanger les restes de riz avec des œufs battus, de la chapelure et du fromage râpé dans un grand bol.",
      "Former des croquettes à partir du mélange en utilisant vos mains.",
      "Faire chauffer de l'huile dans une poêle à feu moyen.",
      "Faire frire les croquettes jusqu'à ce qu'elles soient dorées et croustillantes des deux côtés."
    ],
    "photo": "https://static.750g.com/images/1200-630/5bccd16b8835b8ecba86bd662ee3fd13/comment-faire-des-supplial-telefono-croquettes-de-riz-a-la-mozzarella-.jpg",
    "ingredients": ["restes de riz", "œufs", "chapelure", "fromage râpé"],
    "quantity_ingredients": ["400g", "2", "100g", "50g"],
    "tags": ["Recette anti-gaspillage", "végétarien", "accompagnement"]
  },
  {
    "_id": {"$oid": "b51f7e38e4479065b24a7c61"},
    "name": "Tarte aux restes de légumes",
    "description": "Une tarte rustique et savoureuse qui utilise les restes de légumes pour créer une délicieuse garniture. Cette tarte peut être servie chaude ou froide et est parfaite pour les pique-niques ou les déjeuners légers.",
    "type_of_cuisine": 0,
    "type_of_dishes": 3,
    "specific_regime": 0,
    "preparation_time": 3,
    "culinary_skill_level": 2,
    "nutritional_value": [true, false, true, true, false, false, false, false],
    "preparation_steps": [
      "Préchauffer le four à 180°C et préparer la pâte à tarte selon votre recette préférée.",
      "Étaler la pâte dans un moule à tarte et piquer le fond avec une fourchette.",
      "Répartir uniformément les restes de légumes sur le fond de tarte.",
      "Battre les œufs avec la crème dans un bol et verser sur les légumes.",
      "Cuire au four pendant 25-30 minutes ou jusqu'à ce que la tarte soit dorée et que la garniture soit prise."
    ],
    "photo": "https://mutti-parma.com/app/uploads/sites/17/2020/07/tarte-aux-legumes-grilles-jambon-pignons-origan-et-sauce-tomate-parmigiano-reggiano-e1599139616569.jpg",
    "ingredients": ["pâte à tarte", "restes de légumes", "œufs", "crème"],
    "quantity_ingredients": ["1", "400g", "3", "200ml"],
    "tags": ["Recette anti-gaspillage", "végétarien", "plat principal"]
  },
  {
    "_id": {"$oid": "c927db86057bbaa5df16a903"},
    "name": "Pain perdu",
    "description": "Une manière délicieuse d'utiliser le pain rassis en le trempant dans un mélange sucré d'œufs et de lait, puis en le faisant frire jusqu'à ce qu'il soit doré et croustillant. Le pain perdu peut être servi en dessert ou en brunch pour une touche réconfortante.",
    "type_of_cuisine": 0,
    "type_of_dishes": 4,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 1,
    "nutritional_value": [false, false, true, true, false, false, false, false],
    "preparation_steps": [
      "Battre les œufs avec le lait et la vanille dans un bol peu profond.",
      "Tremper les tranches de pain dans le mélange d'œufs jusqu'à ce qu'elles soient bien imbibées.",
      "Faire chauffer du beurre dans une poêle à feu moyen.",
      "Faire cuire les tranches de pain trempées dans le mélange d'œufs jusqu'à ce qu'elles soient dorées et croustillantes des deux côtés."
    ],
    "photo": "https://cdn.chefclub.tools/uploads/recipes/cover-thumbnail/ca88b3ac-37c4-4972-97ea-d569783b75ad_cyuUcPl.jpg",
    "ingredients": ["pain rassis", "œufs", "lait", "vanille"],
    "quantity_ingredients": ["4 tranches", "2", "200ml", "1 cuillère à café"],
    "tags": ["Recette anti-gaspillage", "dessert"]
  },
  {
    "_id": {"$oid": "e815cafd1f3eb1cd6a8b0f3e"},
    "name": "Omelette aux restes de légumes",
    "description": "Une omelette savoureuse et nutritive qui utilise les restes de légumes pour créer un repas rapide et sain. Cette omelette est parfaite pour le petit-déjeuner, le déjeuner ou le dîner et peut être personnalisée avec vos légumes préférés.",
    "type_of_cuisine": 0,
    "type_of_dishes": 2,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 2,
    "nutritional_value": [true, false, true, true, false, false, false, false],
    "preparation_steps": [
      "Battre les œufs dans un bol jusqu'à ce qu'ils soient bien mélangés.",
      "Faire revenir les restes de légumes dans une poêle avec un peu d'huile d'olive jusqu'à ce qu'ils soient tendres.",
      "Verser les œufs battus sur les légumes dans la poêle et cuire jusqu'à ce que les œufs soient pris sur les bords.",
      "Utiliser une spatule pour soulever les bords de l'omelette et laisser le liquide non cuit s'écouler sous les bords.",
      "Lorsque l'omelette est presque prise mais encore légèrement baveuse au centre, saupoudrer de fromage râpé sur une moitié de l'omelette.",
      "Plier l'autre moitié de l'omelette sur le fromage et laisser cuire encore quelques instants jusqu'à ce que le fromage soit fondu et que l'omelette soit complètement prise."
    ],
    "photo": "https://www.osezlessaveurs.ca/wp-content/uploads/OmelletteWithHave.jpg",
    "ingredients": ["œufs", "restes de légumes", "fromage râpé"],
    "quantity_ingredients": ["3", "400g", "50g"],
    "tags": ["Recette anti-gaspillage", "végétarien", "plat principal"]
  },
  {
    "_id": {"$oid": "3b19c4b5739771c7a1e22ac4"},
    "name": "Salade de quinoa aux restes de légumes",
    "description": "Une salade fraîche et saine qui utilise les restes de légumes et le quinoa pour créer un plat coloré et nutritif. Cette salade est parfaite pour un déjeuner léger ou comme accompagnement pour un dîner copieux.",
    "type_of_cuisine": 0,
    "type_of_dishes": 1,
    "specific_regime": 0,
    "preparation_time": 3,
    "culinary_skill_level": 1,
    "nutritional_value": [true, true, true, true, true, false, false, false],
    "preparation_steps": [
      "Cuire le quinoa selon les instructions sur l'emballage.",
      "Couper les restes de légumes en petits morceaux pour une texture uniforme dans la salade.",
      "Mélanger le quinoa cuit et les légumes dans un grand saladier.",
      "Assaisonner la salade avec de l'huile d'olive, du jus de citron, du sel et du poivre selon votre goût.",
      "Mélanger tous les ingrédients jusqu'à ce qu'ils soient bien enrobés de vinaigrette.",
      "Réfrigérer la salade pendant au moins une heure avant de servir pour permettre aux saveurs de se marier."
    ],
    "photo": "https://i0.wp.com/les2quiches.com/wp-content/uploads/2022/08/salade-quinoa-legumes-rotis-3.jpg?fit=1536%2C2048&ssl=1",
    "ingredients": ["quinoa", "restes de légumes", "huile d'olive", "jus de citron"],
    "quantity_ingredients": ["200g", "400g", "2 cuillères à soupe", "1 cuillère à soupe"],
    "tags": ["Recette anti-gaspillage", "végétarien", "salade"]
  },
  {
    "_id": {"$oid": "5e7dcfd062865c54b56e26b4"},
    "name": "Boulettes de viande aux restes de pain",
    "description": "Des boulettes de viande tendres et savoureuses faites avec des restes de pain trempés dans du lait pour plus de moelleux. Ces boulettes peuvent être servies avec une sauce tomate pour un repas réconfortant ou utilisées comme garniture pour des sandwichs.",
    "type_of_cuisine": 0,
    "type_of_dishes": 2,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 2,
    "nutritional_value": [false, false, true, true, false, false, false, false],
    "preparation_steps": [
      "Tremper le pain dans du lait pour le ramollir et l'émietter dans un grand bol.",
      "Ajouter la viande hachée, l'œuf battu, l'ail haché, le persil haché, le sel et le poivre dans le bol avec le pain.",
      "Mélanger tous les ingrédients jusqu'à ce qu'ils soient bien combinés.",
      "Former des boulettes de la taille d'une balle de golf avec le mélange.",
      "Faire chauffer de l'huile dans une grande poêle à feu moyen.",
      "Faire frire les boulettes de viande jusqu'à ce qu'elles soient dorées et cuites à cœur, environ 8 à 10 minutes par côté."
    ],
    "photo": "https://resize.elle.fr/original/var/plain_site/storage/images/elle-a-table/recettes-de-cuisine/boulettes-juteuses-a-la-mie-de-pain-3147169/68751085-2-fre-FR/Boulettes-juteuses-a-la-mie-de-pain.jpeg",
    "ingredients": ["restes de pain", "viande hachée", "œuf", "ail", "persil"],
    "quantity_ingredients": ["200g", "500g", "1", "2 gousses", "2 cuillères à soupe"],
    "tags": ["Recette anti-gaspillage", "viande", "plat principal"]
  },
  {
    "_id": {"$oid": "16a3a28cb0fa089e5d1bc928"},
    "name": "Frittata aux restes de légumes",
    "description": "Une frittata italienne délicieuse et rapide à préparer, parfaite pour utiliser les restes de légumes. Cette frittata est cuite à la poêle et finie sous le gril pour une texture dorée et un intérieur moelleux rempli de légumes savoureux.",
    "type_of_cuisine": 2,
    "type_of_dishes": 2,
    "specific_regime": 0,
    "preparation_time": 2,
    "culinary_skill_level": 2,
    "nutritional_value": [true, false, true, true, false, false, false, false],
    "preparation_steps": [
      "Faire revenir les restes de légumes dans une poêle avec de l'huile d'olive jusqu'à ce qu'ils soient tendres et légèrement dorés.",
      "Battre les œufs dans un bol jusqu'à ce qu'ils soient bien mélangés.",
      "Verser les œufs battus sur les légumes dans la poêle.",
      "Cuire la frittata à feu doux jusqu'à ce que les œufs soient pris sur les bords mais encore légèrement baveux au centre.",
      "Terminer la cuisson sous le gril pendant quelques minutes jusqu'à ce que le dessus de la frittata soit doré et légèrement gonflé."
    ],
    "photo": "https://carrefour-reunion.uplink.re/glide/local/attachments/buz/p1d/4it/buzp1d4it6k5fvsx63sn74u8x.jpg?w=512&h=512&fit=crop&s=2cf7efaaef81bee3019f4a389a8679b3",
    "ingredients": ["œufs", "restes de légumes", "fromage râpé"],
    "quantity_ingredients": ["4", "400g", "50g"],
    "tags": ["Recette anti-gaspillage", "végétarien", "plat principal"]
  }
]
